Repository: Shakhriyor2211/xazna-ai
Catalog: server/locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: The Email must be set.
ru: Необходимо указать электронную почту.
uz: Email manzili kiritilishi shart.

source: Enter a valid email address.
ru: Введите корректный адрес электронной почты.
uz: To‘g‘ri email manzilini kiriting.

source: Email and password are required.
ru: Необходимо указать электронную почту и пароль.
uz: Email va parol talab qilinadi.

source: Invalid credentials.
ru: Неверные учетные данные.
uz: Noto‘g‘ri autentifikatsiya ma’lumotlari.

source: User is blocked.
ru: Пользователь заблокирован.
uz: Foydalanuvchi bloklangan.

source: Email is already taken.
ru: Эта электронная почта уже используется.
uz: Bu email allaqachon ishlatilgan.

source: Password and confirm password do not match.
ru: Пароль и подтверждение пароля не совпадают.
uz: Parol va tasdiqlash paroli mos kelmaydi.

source: Old password is incorrect.
ru: Старый пароль указан неверно.
uz: Eski parol noto‘g‘ri.

source: New password cannot be the same as the old password.
ru: Новый пароль не может совпадать со старым.
uz: Yangi parol eski parol bilan bir xil bo‘la olmaydi.

source: Passwords do not match.
ru: Пароли не совпадают.
uz: Parollar mos kelmaydi.

source: User not found.
ru: Пользователь не найден.
uz: Foydalanuvchi topilmadi.

source: User temporarily blocked.
ru: Пользователь временно заблокирован.
uz: Foydalanuvchi vaqtincha bloklangan.

source: Resend confirmation code limit exceeded.
ru: Превышен лимит повторной отправки кода подтверждения.
uz: Tasdiqlash kodini qayta yuborish limiti oshib ketdi.

source: Confirmation code was sent to your email address.
ru: Код подтверждения отправлен на вашу электронную почту.
uz: Tasdiqlash kodi sizning email manzilingizga yuborildi.

source: Failed to send confirmation code.
ru: Не удалось отправить код подтверждения.
uz: Tasdiqlash kodini yuborishda xatolik yuz berdi.

source: Invalid confirmation code.
ru: Неверный код подтверждения.
uz: Noto‘g‘ri tasdiqlash kodi.

source: Confirmation code is expired.
ru: Код подтверждения истёк.
uz: Tasdiqlash kodi muddati o‘tgan.

source: Refresh token is required.
ru: Необходим refresh токен.
uz: Refresh token talab qilinadi.

source: Invalid refresh token.
ru: Неверный refresh токен.
uz: Noto‘g‘ri refresh token.

source: Access token is required.
ru: Необходим access токен.
uz: Access token talab qilinadi.

source: Access token is valid.
ru: Access токен действителен.
uz: Access token amal qiladi.

source: Invalid token.
ru: Недействительный токен.
uz: Noto‘g‘ri token.

source: Logged out successfully.
ru: Вы успешно вышли из системы.
uz: Muvaffaqiyatli tizimdan chiqildi.

source: Missing code.
ru: Код отсутствует.
uz: Kod mavjud emas.

source: Failed to exchange code.
ru: Не удалось обменять код.
uz: Kod almashinuvida xatolik yuz berdi.

source: No id_token in response.
ru: id_token отсутствует в ответе.
uz: Javobda id_token mavjud emas.

source: Account is blocked.
ru: Аккаунт заблокирован.
uz: Hisob bloklangan.

source: Something went wrong.
ru: Что-то пошло не так.
uz: Nimadir noto‘g‘ri ketdi.

source: Email address is required.
ru: Требуется адрес электронной почты.
uz: Email manzili talab qilinadi.

source: User is inactive or blocked.
ru: Пользователь неактивен или заблокирован.
uz: Foydalanuvchi faol emas yoki bloklangan.

source: Message sent successfully.
ru: Сообщение успешно отправлено.
uz: Xabar muvaffaqiyatli yuborildi.

source: Password is required.
ru: Необходим пароль.
uz: Parol talab qilinadi.

source: Confirm password is required.
ru: Необходимо подтвердить пароль.
uz: Parolni tasdiqlash talab qilinadi.

source: Password updated successfully.
ru: Пароль успешно обновлён.
uz: Parol muvaffaqiyatli yangilandi.

source: Profile picture removed.
ru: Фотография профиля удалена.
uz: Profil rasmi o‘chirildi.

source: No picture found for this user.
ru: У пользователя нет фотографии.
uz: Bu foydalanuvchi uchun rasm topilmadi.

source: Data successfully deleted.
ru: Данные успешно удалены.
uz: Ma’lumot muvaffaqiyatli o‘chirildi.

source: Data not found.
ru: Данные не найдены.
uz: Ma’lumot topilmadi.

source: Balance settings changed successfully.
ru: Настройки баланса успешно изменены.
uz: Balans sozlamalari muvaffaqiyatli o‘zgartirildi.

source: Internal server error
ru: Внутренняя ошибка сервера.
uz: Ichki server xatosi

source: Session not found.
ru: Сессия не найдена.
uz: Sessiya topilmadi.

source: Content is required.
ru: Необходимо указать содержимое.
uz: Kontent talab qilinadi.

source: Model is required.
ru: Необходимо указать модель.
uz: Model talab qilinadi.

source: Internal server error.
ru: Внутренняя ошибка сервера.
uz: Ichki server xatosi.

source: Permission denied.
ru: Доступ запрещён.
uz: Ruxsat berilmadi.

source: Session limit reached.
ru: Достигнут лимит сессий.
uz: Sessiyalar limiti oshdi.

source: Not enough founds.
ru: Недостаточно средств.
uz: Yetarli mablag‘ mavjud emas.

source: Not enough credits.
ru: Недостаточно кредитов.
uz: Yetarli kredit mavjud emas.

source: Request limit exceeded.
ru: Превышен лимит запросов.
uz: So‘rovlar limiti oshdi.

source: Title is required.
ru: Необходимо указать название.
uz: Sarlavha talab qilinadi.

source: Session successfully deleted.
ru: Сессия успешно удалена.
uz: Sessiya muvaffaqiyatli o‘chirildi.

source: Token not found.
ru: Токен не найден.
uz: Token topilmadi.

source: Data successfully edited.
ru: Данные успешно изменены.
uz: Ma’lumot muvaffaqiyatli tahrirlandi.

source: Key settings changed successfully.
ru: Настройки ключа успешно изменены.
uz: Kalit sozlamalari muvaffaqiyatli o‘zgartirildi.

source: Model not found.
ru: Модель не найдена.
uz: Model topilmadi.

source: Not enough credits
ru: Недостаточно кредитов.
uz: Yetarli kredit mavjud emas

source: Message limit reached, open new session.
ru: Достигнут лимит сообщений, откройте новую сессию.
uz: Xabarlar limiti oshdi, yangi sessiya oching.

source: Data successfully changed.
ru: Данные успешно изменены.
uz: Ma’lumot muvaffaqiyatli o‘zgartirildi.

source: This plan can't be restarted.
ru: Этот тариф нельзя перезапустить.
uz: Ushbu reja qayta ishga tushirilmaydi.

source: Not enough funds, please top up your balance.
ru: Недостаточно средств, пожалуйста пополните баланс.
uz: Yetarli mablag‘ mavjud emas, balansni to‘ldiring.

source: Subscription restarted successfully.
ru: Подписка успешно перезапущена.
uz: Obuna muvaffaqiyatli qayta ishga tushirildi.

source: Plan not found.
ru: Тариф не найден.
uz: Reja topilmadi.

source: Failed to change subscription.
ru: Не удалось изменить подписку.
uz: Obunani o‘zgartirishda xatolik yuz berdi.

source: Subscription changed successfully.
ru: Подписка успешно изменена.
uz: Obuna muvaffaqiyatli o‘zgartirildi.
